packages/cf-boot/cf-boot-1.14.0.tar.gz/cf-boot-1.14.0/cfboot/scripts/extract-service-credentials/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>extract-service-credentials</title>
<!-- 2018-03-26 Mon 11:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ernesto Alfonso" />
</head>
<body>
<div id="content">
<h1 class="title">extract-service-credentials</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Inputs</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>arg name</b></td>
<td class="left"><b>JSON type</b></td>
<td class="left"><b>example</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">ref_app_guid</td>
<td class="left">string</td>
<td class="left">"f9e82e7f-5f15-4ea9-b499-9ceab30d9660"</td>
<td class="left">guid of a sample app</td>
</tr>

<tr>
<td class="left">service_instance_guid</td>
<td class="left">string</td>
<td class="left">"845f80d1-14ec-4144-82fd-d6417bedb7b7"</td>
<td class="left">guid of the service instance</td>
</tr>

<tr>
<td class="left">credential_paths</td>
<td class="left">map (string-&gt;list of string)</td>
<td class="left">{"acs_zone": ["zone", "http-header-value"], "acs_uri": ["uri"]}</td>
<td class="left">A map {"OUTPUT_KEY_NAME" : ["json", "path", "to", "credential"] }</td>
</tr>

<tr>
<td class="left">cf_home</td>
<td class="left">string</td>
<td class="left">"/User/12345"</td>
<td class="left">CF_HOME where login has been issued, defaults to $HOME</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">credential path</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A credential path specifies the list of accessors used to "walk down" from the root credentials map to the desired credential.
</p>
<ul class="org-ul">
<li>Example credentials map:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js">"credentials": {
       "uri": "https://predix-acs.run.asv-pr.ice.predix.io",
       "zone": {
         "http-header-value": "d5eaf878-f6ba-4da3-83c1-9ebccd5aeda0",
         "oauth-scope": "predix-acs.zones.d5eaf878-f6ba-4da3-83c1-9ebccd5aeda0.user",
         "http-header-name": "Predix-Zone-Id"
       }
     }
</pre>
</div>
<ul class="org-ul">
<li>Example "credential_paths" input
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js">{"acs_zone": ["zone", "http-header-value"],
 "acs_uri": ["uri"]}
</pre>
</div>


<p>
For convenience on the common case where the credential one level from the root, it is possible to pass a string instead of a singleton. The above is equivalent to:
</p>
<div class="org-src-container">

<pre class="src src-js">{"acs_zone": ["zone", "http-header-value"],
 "acs_uri": "uri"}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Examples:</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>extract uaa uri
<ul class="org-ul">
<li>input
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js">{
 "service_instance_guid": "908485db-10b7-4bc2-acfc-740f1bc540e7",
 "app_guid": "f9e82e7f-5f15-4ea9-b499-9ceab30d9660",
 "credential_paths": {"uaa_uri": ["uri"]}
}
</pre>
</div>
<ul class="org-ul">
<li>output
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js">{
 "uaa_uri": "https://908485db-10b7-4bc2-acfc-740f1bc540e7.predix-uaa.run.asv-pr.ice.predix.io",
}
</pre>
</div>
</li>
<li>extract acs zone, uri

<div class="org-src-container">

<pre class="src src-js">{
 "app_guid": "f9e82e7f-5f15-4ea9-b499-9ceab30d9660",
 "service_instance_guid": "845f80d1-14ec-4144-82fd-d6417bedb7b7",
 "credential_paths": {"acs_zone": ["zone", "http-header-value"],
                            "acs_uri": ["uri"]}
 }
</pre>
</div>
<ul class="org-ul">
<li>output
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js">{
 "acs_zone": "d5eaf878-f6ba-4da3-83c1-9ebccd5aeda0",
 "acs_uri": "https://predix-acs.run.asv-pr.ice.predix.io"
}
</pre>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Outputs</h2>
<div class="outline-text-2" id="text-2">
<p>
A json mapping each credential name to its value. See examples above
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Idempotence</h2>
<div class="outline-text-2" id="text-3">
<p>
The script may be called any number of times. Whenever the binding does not exist, it is created.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Implementation details: How it works</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Bind the app to the service instance.
Since we're given the app and instance <b>guids</b> instead of names, it's inconvenient to use <code>cf create-servce</code>.
We use the <a href="http://apidocs.cloudfoundry.org">cf api</a> (via cf curl) to directly <a href="http://apidocs.cloudfoundry.org/237/service_bindings/create_a_service_binding.html">POST a service binding</a>
</li>
<li>The request may "fail" with error code "CF-ServiceBindingAppServiceTaken". This is OK, and to preserve idempotence, we need to explicitly ignore this error.
</li>
<li>We use the cf api to obtain the service binding payload (which includes credentials).
<ul class="org-ul">
<li>We use the <a href="http://apidocs.cloudfoundry.org/237/service_bindings/list_all_service_bindings.html">"/v2/service_bindings?q=service_instance_guid:{}&amp;q=app_guid:{}"</a> endpoint<br  />
       (List all service bindings filtering by both service instance and app guid)
</li>

<li>Example response
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js">     {
  "total_results": 1,
  "next_url": null,
  "total_pages": 1,
  "prev_url": null,
  "resources": [
    {
      "metadata": {
        "url": "/v2/service_bindings/06a55a45-4e02-42df-8d99-34fa346bf1d4",
        "created_at": "2016-08-05T14:44:55Z",
        "guid": "06a55a45-4e02-42df-8d99-34fa346bf1d4",
        "updated_at": null
      },
      "entity": {
        "app_url": "/v2/apps/ec9c28c9-c27a-4cb5-95f2-546fc2d5e45f",
        "binding_options": {},
        "gateway_name": "",
        "gateway_data": null,
        "syslog_drain_url": null,
        "credentials": {
          "uri": "https://predix-acs.run.asv-pr.ice.predix.io",
          "zone": {
            "http-header-value": "d5eaf878-f6ba-4da3-83c1-9ebccd5aeda0",
            "oauth-scope": "predix-acs.zones.d5eaf878-f6ba-4da3-83c1-9ebccd5aeda0.user",
            "http-header-name": "Predix-Zone-Id"
          }
        },
        "service_instance_guid": "d5eaf878-f6ba-4da3-83c1-9ebccd5aeda0",
        "app_guid": "ec9c28c9-c27a-4cb5-95f2-546fc2d5e45f",
        "volume_mounts": [],
        "service_instance_url": "/v2/service_instances/d5eaf878-f6ba-4da3-83c1-9ebccd5aeda0"
      }
    }
  ]
}
</pre>
</div>
</li>

<li>There can only be one service binding for an (app, service-instance) pair.
We make sure this is the case
</li>
<li>Extract the credentials map from the service binding.
Go through each (credential-name, credential-path),  from user input to construct an output map.
</li>
</ol>
</div>
</div>
</div>
</body>
</html>
